Zektopic/ESP32-CAM_MJPEG2SD/utilsLog.cpp

/*********************** Remote loggging ***********************/
/*
 * Log mode selection in user interface: 
 * false : log to serial / web monitor only
 * true  : also saves log on SD card. To download the log generated, either:
 *  - To view the log, press Show Log button on the browser
 * - To clear the log file contents, on log web page press Clear Log link
 */
 
#ifndef TEST_ENV
#include "appGlobals.h"
#include "freertos/atomic.h"

bool dbgVerbose = false;

#define LOG_BUF_COUNT 4  // number of pool buffers —  number of concurrent calling tasks
#define LOG_QUEUE_DEPTH LOG_BUF_COUNT
#define HWM_MIN 32 // less than these bytes with debug exception probably indicates stack overflow
#define HWM_MAX 128 // more than these bytes with debug exception probably indicates printf formatting causing break
#define WRITE_CACHE_CYCLE 5

// Pool: fixed array of buffers 
static char (*poolBufs)[MAX_OUT] = NULL;
// Queue storage sized correctly as raw bytes (sizeof(char*) per slot)
static uint8_t freePoolStorage[LOG_BUF_COUNT * sizeof(char*)];
static uint8_t logQueueStorage[LOG_QUEUE_DEPTH * sizeof(char*)];
static StaticQueue_t freePoolStatic;
static StaticQueue_t logQueueStatic;
QueueHandle_t logFreePool = NULL;
QueueHandle_t logQueue = NULL;
TaskHandle_t logHandle = NULL;
static uint32_t dropCount = 0; // Atomic drop counter — safe to increment from any task

bool useLogColors = false;  // true to colorise log messages (eg if using idf.py, but not arduino)
bool sdLog = false; // log to SD
int logType = 0; // which log contents to display (0 : ram, 1 : sd)
static FILE* log_remote_fp = NULL;
static uint32_t counter_write = 0;
// allow any startup failures to be reported via browser for remote devices
char startupFailure[SF_LEN] = {0};

// RAM memory based logging in RTC slow memory (cannot init)
RTC_NOINIT_ATTR char messageLog[RAM_LOG_LEN];
RTC_NOINIT_ATTR uint16_t mlogEnd;
static RTC_NOINIT_ATTR char brownoutStatus;
static RTC_NOINIT_ATTR uint32_t crashLoop;
static RTC_NOINIT_ATTR uint32_t backtrace[60]; // array of backtrace addresses 
static RTC_NOINIT_ATTR size_t btLen; // number of backtrace entries
static RTC_NOINIT_ATTR char btReason[64]; // reason for panic
static RTC_NOINIT_ATTR char btTask[20]; // task name
static RTC_NOINIT_ATTR int btCore; // cpu core id
static RTC_NOINIT_ATTR uint32_t btHWM; // high water mark bytes left
static RTC_NOINIT_ATTR uint32_t haveTrace; // boolean


void resetCrashLoop() {
  crashLoop = 0;
}

void logIncrementDropCount(void) {
  Atomic_Increment_u32(&dropCount);
}

void saveRamLog(const char* ramLogName) {
  // save ramlog to storage 
  File ramFile = STORAGE.open(ramLogName, FILE_WRITE);
  int startPtr, endPtr;
  startPtr = endPtr = mlogEnd;  
  // write log in chunks
  do {
    int maxChunk = startPtr < endPtr ? endPtr - startPtr : RAM_LOG_LEN - startPtr;
    size_t chunkSize = std::min(CHUNKSIZE, maxChunk);    
    if (chunkSize > 0) ramFile.write((uint8_t*)messageLog + startPtr, chunkSize);
    startPtr += chunkSize;
    if (startPtr >= RAM_LOG_LEN) startPtr = 0;
    vTaskDelay(1);
  } while (startPtr != endPtr);
  ramFile.close();
}

static void ramLogClear() {
  mlogEnd = 0;
  memset(messageLog, 0, RAM_LOG_LEN);
}
  
static void ramLogStore(const char* outBuf, size_t msgLen) {
  // save log entry in ram buffer
  if (mlogEnd + msgLen >= RAM_LOG_LEN) {
    // log needs to roll around cyclic buffer
    uint16_t firstPart = RAM_LOG_LEN - mlogEnd;
    memcpy(messageLog + mlogEnd, outBuf, firstPart);
    msgLen -= firstPart;
    memcpy(messageLog, outBuf + firstPart, msgLen);
    mlogEnd = 0;
  } else memcpy(messageLog + mlogEnd, outBuf, msgLen);
  mlogEnd += msgLen;
}

void flush_log(bool andClose) {
  if (log_remote_fp != NULL) {
    fsync(fileno(log_remote_fp));  
    fflush(log_remote_fp);
    if (andClose) {
      LOG_INF("Closed SD file for logging");
      fclose(log_remote_fp);
      log_remote_fp = NULL;
    } else delay(1000);
  }  
}

static void remote_log_init_SD() {
#if !CONFIG_IDF_TARGET_ESP32C3
  STORAGE.mkdir(DATA_DIR);
  // Open remote file
  log_remote_fp = NULL;
  log_remote_fp = fopen("/sdcard" LOG_FILE_PATH, "a");
  if (log_remote_fp == NULL) {LOG_WRN("Failed to open SD log file %s", LOG_FILE_PATH);}
  else {
    logLine();
    LOG_INF("Opened SD file for logging");
  }
#endif
}

void reset_log() {
  if (logType == 0) ramLogClear();
  if (logType == 1) {
    if (log_remote_fp != NULL) flush_log(true); // Close log file
    STORAGE.remove(LOG_FILE_PATH);
    remote_log_init_SD();
  }
  LOG_INF("Cleared %s log file", logType == 0 ? "RAM" : "SD"); 
}

void remote_log_init() {
  // setup required log mode
  if (sdLog) {
    flush_log(false);
    remote_log_init_SD(); // store log on sd card
  } else flush_log(true);
}

static void logTask(void *pvParams) {
  // separate task to reduce stack size in other tasks
  char *msg;
  while (true) {
    if (xQueueReceive(logQueue, &msg, portMAX_DELAY) == pdTRUE) {
      // logTask is sole consumer so safe without locking
      msg[MAX_OUT - 2] = '\n'; 
      msg[MAX_OUT - 1] = 0; // ensure always have ending newline
      // output message to various recipients
      size_t msgLen = strlen(msg);
      if (msgLen > 1) {
#ifdef AUXILIARY
        sendSSE("log", msg);
#else
        wsAsyncSendText(msg); // output to browser over web socket
#endif
        if (msg[msgLen - 2] == '~') msg[msgLen - 2] = ' '; // remove '~' if present
      }
      if (monitorOpen) {
        // output to monitor console if attached
        fputs(msg, stdout);
        fflush(stdout);
      } else delay(10); // allow time for other tasks
      if (msgLen > 1) {
        ramLogStore(msg, msgLen); // store in rtc ram 
        if (sdLog) {
          if (log_remote_fp != NULL) {
            // output to SD if file opened
            fwrite(msg, sizeof(char), msgLen, log_remote_fp); // log.txt
            // periodic sync to SD
            if (counter_write++ % WRITE_CACHE_CYCLE == 0) fsync(fileno(log_remote_fp));
          } 
        }
      }
      // return buffer to pool — use portMAX_DELAY as pool should
      // always have space (only send as many messages as pool slots)
      xQueueSend(logFreePool, &msg, portMAX_DELAY);
    }
  }
}

void logLine() {
  LOG_SEND(" \n");
}

int vprintfRedirect(const char* format, va_list args) {
  // format esp_log() output for LOG_SEND()
  char buffer[256];
  int len = vsnprintf(buffer, sizeof(buffer), format, args);
  LOG_SEND("%s", buffer);
  return len;
}


